text = """
Муниципальное бюджетное общеобразовательное учреждение «Средняя общеобразовательная школа №4 п. Тавричанка Надеждинского района» имени В.Н. Косова

ИНДИВИДУАЛЬНЫЙ ИТОГОВЫЙ ПРОЕКТ

«Искусственный интеллект - помощник в работе.

Возможности и применение искусственного интеллекта.»

Выполнил ученик 11 «А» класса

Кочетков Алексей Алексеевич

Руководитель проекта:

Учитель информатики

Киселева Юлия Владимировна

Тавричанка, 2023 год

########### Содержание

Введение        2

Глава I. Искусственный интеллект        3

1.1.Типы ИИ     4

1.2.Важные события истории ИИ   5

1.3.В каких областях применяются возможности ИИ 6

1.4.Плюсы и Минусы искусственного интеллекта    8

1.4.1.Плюсы искусственного интеллекта   8

1.4.2. Минусы искусственного интеллекта 8

Глава II. Создание бота 10

2.1. Этап создания бота 10

2.2. Что умеет этот бот 11

2.3. Что дальше?        12

Заключение      13

## Введение

**Актуальность:** На сегодняшний день искусственный интеллект набирает огромную популярность во всех направлениях нашей жизни. В некоторых отраслях мы уже не можем обойтись без использования искусственного интеллекта.

**Проблема:** Отсутствие автоматизации учебного процесса в школе.

**Гипотеза:** Я считаю, что чат-бот сможет автоматизировать и оптимизировать учебный процесс.

**Цель проекта:** Автоматизировать учебный процесс.

**Задачи:**

1. Изучить информацию о искусственном интеллекте.
2. Рассмотреть где применяются возможности искусственного интеллекта.
3. Рассмотреть примеры чат-бота.
4. Основываясь на основе найденного материала создать чат-бота.

С момента изобретения компьютеров, их способность выполнять различные задачи продолжают расти в геометрической прогрессии. Когда большинство людей слышат термин «искусственный интеллект», первое, о чем они обычно думают, — это роботы.  Это потому, что в высокобюджетных фильмах и романах рассказывается о человекоподобных машинах, которые сеют хаос на Земле. Но ничто не может быть дальше от истины.

Развитие ИИ началось с намерения создать в машинах интеллект, схожий с человеческим. Искусственный интеллект — наука, стоящая на стыке информатики, кибернетики, нейробиологии и психологии, изучающая возможность вычислительных машин и других искусственных устройств брать на себя отдельные функции интеллекта человека.

## Глава I. Искусственный интеллект

Искусственный интеллект — это обширная отрасль компьютерных наук, занимающаяся созданием интеллектуальных машин, способных выполнять задачи, которые обычно требуют человеческого интеллекта. ИИ достигается путем изучения моделей человеческого мозга и анализа когнитивного процесса. В результате этих исследований разрабатывается интеллектуальное программное обеспечение и системы.

Искусственный интеллект основан на том принципе, что человеческий интеллект можно определить таким образом, чтобы машина могла легко [имитировать его и выполнять задачи](https://www.investopedia.com/terms/k/knowledge-engineering.asp) , от самых простых до еще более сложных. Цели искусственного интеллекта включают имитацию когнитивной деятельности человека. Исследователи и разработчики в этой области добиваются удивительно быстрых успехов в имитации таких действий, как обучение, рассуждение и восприятие, в той мере, в какой они могут быть конкретно определены. Некоторые считают, что вскоре новаторы смогут разработать системы, которые превзойдут возможности людей в изучении или осмыслении любого предмета. Но другие остаются скептичными, потому что вся когнитивная деятельность пронизана оценочными суждениями, которые зависят от человеческого опыта.

По мере развития технологий предыдущие тесты, которые определяли искусственный интеллект, устаревают. Например, машины, которые вычисляют базовые функции или распознают текст с помощью оптического распознавания символов, больше не считаются воплощением искусственного интеллекта, поскольку эта функция теперь воспринимается как неотъемлемая функция компьютера.

ИИ постоянно развивается, чтобы принести пользу многим различным отраслям.

###

## 1 Типы ИИ

Тип 1: Реактивные машины. Эти системы ИИ не имеют памяти и зависят от конкретной задачи. Примером может служить Deep Blue, [шахматная программа IBM](https://www.techtarget.com/searchitchannel/definition/IBM-International-Business-Machines) , обыгравшая Гарри Каспарова в 1990-х годах. Deep Blue может определять фигуры на шахматной доске и делать прогнозы, но поскольку у него нет памяти, он не может использовать прошлый опыт для информирования будущих.

Тип 2: Ограниченная память. Как следует из названия, ИИ с ограниченной памятью может принимать обоснованные и улучшенные решения, изучая прошлые данные из своей памяти. Такой ИИ имеет кратковременную или временную память, которую можно использовать для хранения прошлого опыта и, следовательно, для оценки будущих действий. Беспилотные автомобили — это ИИ с ограниченной памятью, который использует данные, собранные в недавнем прошлом, для принятия немедленных решений.

Тип 3: Теория разума. Теория сознания — это более продвинутый тип искусственного интеллекта. Применительно к ИИ это означает, что система должна обладать социальным интеллектом, чтобы понимать эмоции. Этот тип ИИ сможет угадывать человеческие намерения и предсказывать поведение, что является необходимым навыком для систем ИИ, чтобы стать неотъемлемыми членами человеческих команд. Теория разума ИИ еще не полностью разработана, но в этой области ведутся тщательные исследования.

Тип 4: Самосознание. В этой категории системы ИИ обладают самоощущением, которое дает им сознание. Машины с самосознанием понимают свое текущее состояние. Этот тип ИИ надуман, его не существует. Однако в будущем не исключена возможность существования сверхразума.

### 1.1 Важные события истории ИИ

1. Одним из поворотных моментов в истории ИИ стала публикация Аланом Тьюрингом статьи «Вычислительные машины и интеллект» в 1950 году. В документе исследовалась идея «Игры в имитацию», которая позже была переименована в «Тест Тьюринга» — предложение, в котором изучалась способность машины мыслить, как человек. Этот тест стал неотъемлемым элементом в области искусственного интеллекта.
2. К 1955 году ученые всего мира начали концептуально размышлять о таких вещах, как нейронные сети и естественный язык, но не было единой концепции, охватывающей различные виды машинного интеллекта. Профессор математики Дартмутского колледжа по имени Джон Маккарти ввел термин «искусственный интеллект», чтобы описать все это.
3. Общественный авторитет искусственного интеллекта получил новый импульс в 1997 году, когда шахматный компьютер IBM Deep Blue победил в шахматах тогдашнего чемпиона мира [Гарри Каспарова.](https://www.fastcompany.com/90319933/chess-legend-garry-kasparov-humans-still-have-the-monopoly-on-evil) В серии из шести игр, сыгранных в телестудии, Deep Blue выиграл две партии, Каспаров выиграл одну, а три партии закончились вничью. Годом ранее Каспаров победил более раннюю версию Deep Blue.
### 1.3.В каких областях применяются возможности ИИ

- ИИ в здравоохранении. Самые большие ставки делаются на улучшение результатов лечения пациентов и снижение затрат. Компании применяют машинное обучение, чтобы ставить более качественные и быстрые диагнозы, чем люди. Одной из самых известных технологий здравоохранения является IBM Watson. Он понимает естественный язык и может отвечать на заданные ему вопросы. Система анализирует данные пациентов и другие доступные источники данных, чтобы сформировать гипотезу, которую затем представляет с помощью схемы оценки достоверности. Другие приложения ИИ включают использование виртуальных медицинских помощников и [чат](https://www.techtarget.com/searchcustomerexperience/definition/chatbot) -ботов , которые помогают пациентам и клиентам в сфере здравоохранения находить медицинскую информацию, назначать встречи, понимать процесс выставления счетов и выполнять другие административные процессы. Множество технологий искусственного интеллекта также используется для прогнозирования, борьбы и понимания [пандемий, таких как COVID-19](https://www.techtarget.com/searchbusinessanalytics/feature/AI-tools-in-analytics-software-key-in-fighting-COVID-19) .
- ИИ в образовании. ИИ может автоматизировать выставление оценок, предоставляя преподавателям больше времени. Он может [оценивать учащихся и адаптироваться к их потребностям](https://www.techtarget.com/searchcio/podcast/Cognitive-tutor-could-teach-employees-new-skills) , помогая им работать в своем собственном темпе. Искусственный интеллект может оказывать дополнительную поддержку учащимся, чтобы они не сбились с пути. И это может изменить то, где и как студенты учатся, возможно, даже заменив некоторых учителей.
- ИИ в производстве. [Роботы](https://ru.wikipedia.org/wiki/%D0%A0%D0%BE%D0%B1%D0%BE%D1%82) стали распространены во многих отраслях промышленности и часто занимаются работой, которая считается опасной для людей. Искусственный интеллект оказался эффективным на рабочих местах, связанных с повторяющимися рутинными заданиями, которые могут привести к ошибкам или несчастным случаям из-за снижения концентрации с течением времени.
- ИИ в банковском деле. Банки успешно используют чат-ботов, чтобы информировать своих клиентов об услугах и предложениях, а также для обработки транзакций, не требующих вмешательства человека. Виртуальные помощники ИИ используются для улучшения и сокращения затрат на соблюдение банковских правил. Банковские организации также используют ИИ для улучшения процесса принятия решений по кредитам, а также для установления кредитных лимитов и выявления инвестиционных возможностей.
- ИИ в транспорте. Помимо фундаментальной роли ИИ в управлении автономными транспортными средствами, технологии ИИ используются на транспорте для управления трафиком, прогнозирования задержек рейсов и повышения безопасности и эффективности морских перевозок.
- ИИ в безопасности. Организации используют машинное обучение в программном обеспечении для управления информацией и событиями безопасности и смежных областях для обнаружения аномалий и выявления подозрительных действий, указывающих на угрозы. Анализируя данные и используя логику для выявления сходства с известным вредоносным кодом, ИИ может предупреждать о новых и возникающих атаках гораздо раньше, чем сотрудники-люди. Технологии играют большую роль, помогая организациям бороться с кибератаками.
- **ИИ в военном деле.** Применение ИИ является важным трендом в создании перспективных систем управления поля боя и вооружением. С помощью ИИ возможно обеспечить оптимальный и адаптивный к угрозам выбор комбинации сенсоров и средств поражения, скоординировать их совместное функционирование, обнаруживать и идентифицировать угрозы, оценивать намерения противника. Примером является РТК «Уран-9», он представляет собой самоходную гусеничную машину с боевым модулем, оснащенным пушечно-пулеметным и реактивным вооружением. В автономном режиме, используя ИИ, такой робот способен двигаться по заданному маршруту, вести наблюдение, искать и поражать цели. При этом решение об открытии огня остается за оператором.

### 1.4.Плюсы и Минусы искусственного интеллекта

#### 1.4.1.Плюсы искусственного интеллекта

1. **Отсутствие человеческой ошибки.**
2. **Нулевые риски.**
3. **Круглосуточная доступность.**
4. Помощь в повторяющихся работах.
5. **Быстрые решения.**

Ошибки уменьшаются, и появляется возможность получать более точные результаты.

Использование машин в задачах, которые могут представлять опасность для человека.

Машины не устают, они могут работать бесконечно, без перерывов.

Используя ИИ, мы можем автоматизировать рутинные задачи человека.

Используя искусственный интеллект, мы можем заставить машины принимать решения быстрее, чем человек, и быстрее выполнять действия.

#### 1.4.2. Минусы искусственного интеллекта

1. **Машины с ИИ несут большие затраты.**
2. **Отсутствие нестандартного мышления.**
3. **Безработица.**

Машины нуждаются в ремонте и обслуживании, которые требуют больших затрат. Его создание требует огромных затрат, так как это очень сложные машины.

Машины могут выполнять только те задачи, для которых они предназначены или запрограммированы. Машине сложно подойти к делу творчески.

ИИ заменяет большинство повторяющихся задач ботами. Потребность во вмешательстве человека снижается, поскольку предприятия стремятся к более безошибочной и безопасной работе.
## Глава II. Создание бота
### 2.1. Этап создания бота
Первым делом мне надо было определиться с сервисом, на основе которого и будет функционировать бот. Для своих целей я выбрал сервис Dialogflow.
Dialogflow – это облачный сервис распознавания естественного языка от Google, который поддерживает различные языки, в том числе русский.
Бот работает по схеме Вопрос-Ответ. После создания бота в Dialogflow, я перешел к его настройкам. У Dialogflow есть раздел, называется он Intents, собственно это и есть раздел с вопросами. Когда мы создаем новый интент, мы указываем тренировочные фразы, тренировочные фразы - это фразы, которые ожидает бот от пользователя, а далее исходя из того, какую тренировочную фразу ввел пользователь, бот подбирает ответ. Ответ записывается в тот же интент, что и вопрос. Для ответа свой раздел, Responses, он находится в связке с тренировочными фразами, ответ указывается в разделе с интентом. Ответ может использоваться не один, ответов может быть множество, это используется для имитации человека.
Когда я закончил с настройками бота и тренировкой его, я перешел к интеграции бота в телеграм.
##
На данный момент функции домашнего задания и расписания уроков работают только для 11А класса.
##
##
##
##
##
##
### 2.2. Что умеет этот бот
    - **Домашняя работа**
    - **Расписание уроков**
    - **Расписание тренировок**
    - **Даты проведения ЕГЭ**
    - **Даты проведения олимпиад**
Домашняя работа предоставляется по ключевому слову: «домашняя работа (можно использовать сокращенный вид «дз») 11А понедельник (или любой другой день недели)». Домашняя работа для класса записывается вручную, через сервис Dialogflow.
Расписание уроков предоставляется по ключевому слову: «расписание уроков 11А понедельник (или любой другой день недели)». По умолчанию на всех днях недели стоит основное расписание одиннадцатого класса, если появляются изменения в расписании, то его можно легко поменять, зайдя на сервис Dialogflow.
Расписание тренировок предоставляется по ключевым словам: «полное расписание тренировок» или «расписание тренировок понедельник (или любой другой день недели)». Расписание тренировок можно редактировать. Можно оставлять пометки о том, что занятий не будет.
Даты проведения ЕГЭ предоставляются по ключевому слову: ««Указываете предмет» егэ».
Этот раздел не представляет из себя ничего особо, он создан только для демонстрации, того что бота можно улучшать, вносить в него другие разделы. Ключевые слова: Олимпиада.
###
###
### 2.3. Что дальше?
Далее можно развивать бота, добавлять в него новые функции. А еще лучше будет переписать бота на языке программирования Python или другом языке, не важно, главное, чтобы чат-бот был независим от Dialogflow. Добавить более удобное редактирование для расписаний уроков и домашних заданий, чтобы учитель не заморачивался. И вписать чат-бота в учебный процесс.
## Заключение**Я задал себе вопрос:** доволен ли я результатом своей работой. Нравится ли мне мой продукт, и стал бы я его использовать. После недолгого использования, я остался доволен. Бот облегчает жизнь ученику, оптимизирует учебный процесс.
Цель моего проекта достигнута, задачи в ходе работы выполнены, гипотеза доказана анкетированием.
За искусственным интеллектом будущее.
Источники итогового проекта
    1. Oracle. Что такое ИИ? Узнайте об искусственном интеллекте. [Электронный ресурс]. – Режим доступа: URL: [https://www.oracle.com/artificial-intelligence/what-is-ai/](https://www.oracle.com/artificial-intelligence/what-is-ai/) .
    2. IBM Cloud Education. Искусственный интеллект. [Электронный ресурс]. – Режим доступа: URL: [https://www.ibm.com/cloud/learn/what-is-artificial-intelligence](https://www.ibm.com/cloud/learn/what-is-artificial-intelligence) .
    3. Алисса Шроер. Искусственный интеллект. [Электронный ресурс]. – Режим доступа: URL: [https://builtin.com/artificial-intelligence](https://builtin.com/artificial-intelligence) .
    4. Эд Бернс, Николь Ласковски, Линда Туччи. Что такое искусственный интеллект (ИИ)? [Электронный ресурс]. – Режим доступа: URL: [https://www.techtarget.com/searchenterpriseai/definition/AI-Artificial-Intelligence](https://www.techtarget.com/searchenterpriseai/definition/AI-Artificial-Intelligence) .
    5. Джейк Франкенфилд. Искусственный интеллект: что это такое и как его использовать. [Электронный ресурс]. – Режим доступа: URL: [https://www.investopedia.com/terms/a/artificial-intelligence-ai.asp](https://www.investopedia.com/terms/a/artificial-intelligence-ai.asp) .
    6. Карин Келли. Что такое искусственный интеллект: типы, история и будущее. [Электронный ресурс]. – Режим доступа: URL: [https://www.simplilearn.com/tutorials/artificial-intelligence-tutorial/what-is-artificial-intelligence](https://www.simplilearn.com/tutorials/artificial-intelligence-tutorial/what-is-artificial-intelligence) .
    7. Виджай Канаде. Что такое искусственный интеллект (ИИ)? Определение, типы, вызовы и тенденции в 2022 году. [Электронный ресурс]. – Режим доступа: URL: [https://www.spiceworks.com/tech/artificial-intelligence/articles/what-is-ai/](https://www.spiceworks.com/tech/artificial-intelligence/articles/what-is-ai/) .
    8. Википедия. Искусственный интеллект. [Электронный ресурс]. – Режим доступа: URL: [https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwjRs\_a0rM77AhWGv4sKHVTvDDwQFnoECBUQAQ&amp;url=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%2598%25D1%2581%25D0%25BA%25D1%2583%25D1%2581%25D1%2581%25D1%2582%25D0%25B2%25D0%25B5%25D0%25BD%25D0%25BD%25D1%258B%25D0%25B9\_%25D0%25B8%25D0%25BD%25D1%2582%25D0%25B5%25D0%25BB%25D0%25BB%25D0%25B5%25D0%25BA%25D1%2582&amp;usg=AOvVaw05KpiGqBigPtUIWP4CLY0d](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=&cad=rja&uact=8&ved=2ahUKEwjRs_a0rM77AhWGv4sKHVTvDDwQFnoECBUQAQ&url=https%3A%2F%2Fru.wikipedia.org%2Fwiki%2F%25D0%2598%25D1%2581%25D0%25BA%25D1%2583%25D1%2581%25D1%2581%25D1%2582%25D0%25B2%25D0%25B5%25D0%25BD%25D0%25BD%25D1%258B%25D0%25B9_%25D0%25B8%25D0%25BD%25D1%2582%25D0%25B5%25D0%25BB%25D0%25BB%25D0%25B5%25D0%25BA%25D1%2582&usg=AOvVaw05KpiGqBigPtUIWP4CLY0d) .
    9. Рябов Кирилл. Искусственный интеллект в российской армии. [Электронный ресурс]. – Режим доступа: URL: [https://topwar.ru/189298-iskusstvennyj-intellekt-v-rossijskoj-armii.html](https://topwar.ru/189298-iskusstvennyj-intellekt-v-rossijskoj-armii.html) .
    10. Зулайха Латиф. Типы искусственного интеллекта, которые вы должны знать. [Электронный ресурс]. – Режим доступа: URL: [https://www.edureka.co/blog/types-of-artificial-intelligence/](https://www.edureka.co/blog/types-of-artificial-intelligence/) .
    11. Маллика Рангая. История искусственного интеллекта. [Электронный ресурс]. – Режим доступа: URL: [https://www.analyticssteps.com/blogs/history-artificial-intelligence-ai](https://www.analyticssteps.com/blogs/history-artificial-intelligence-ai) .
    12. Википедия. История искусственного интеллекта. [Электронный ресурс]. – Режим доступа: URL: [https://en.wikipedia.org/wiki/History\_of\_artificial\_intelligence](https://en.wikipedia.org/wiki/History_of_artificial_intelligence) .
    13. Fastcompany. 10 самых важных моментов в ИИ (на данный момент). [Электронный ресурс]. – Режим доступа: URL: [https://www.fastcompany.com/90402503/the-10-most-important-moments-in-ai-so-far](https://www.fastcompany.com/90402503/the-10-most-important-moments-in-ai-so-far) .
    14. Википедия. Deep Blue. [Электронный ресурс]. – Режим доступа: URL: [https://ru.wikipedia.org/wiki/Deep\_Blue](https://ru.wikipedia.org/wiki/Deep_Blue) .
    15. Сунил Кумар. Преимущества и недостатки искусственного интеллекта. [Электронный ресурс]. – Режим доступа: URL: [https://towardsdatascience.com/advantages-and-disadvantages-of-artificial-intelligence-182a5ef6588c](https://towardsdatascience.com/advantages-and-disadvantages-of-artificial-intelligence-182a5ef6588c) .
    16. АСУ-АНАЛИТИКА. 10 преимуществ и недостатков искусственного интеллекта. [Электронный ресурс]. – Режим доступа: URL: [https://asu-analitika.ru/10-preimushhestv-i-nedostatkov-iskusstvennogo-intellekta](https://asu-analitika.ru/10-preimushhestv-i-nedostatkov-iskusstvennogo-intellekta) .
(3 июня 2020 г.)
(14 марта 2022 г.)
(8 марта 2021 г.)
(16 сентября 2019 г.)
(26 ноября 2019 г.)

Конференция 1956 года в Дартмуте стала моментом, когда ИИ обрел свое имя, свою миссию, свой первый успех и своих основных игроков, и широко считается рождением ИИ.

У Deep Blue было много вычислительной мощности, и он использовал подход «грубой силы», оценивая от 126 до 300 миллионов возможных ходов в секунду, чтобы найти наилучший из возможных. Люди способны исследовать только около 50 ходов за ход.
"""